# Core
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

# Powerline Fonts
tap "caskroom/fonts"

# Slowquit
tap "dteoh/sqa"

# Lazygit
tap "jesseduffield/lazygit"

# Languages
brew "pyenv"
brew "node"
brew "go"
brew "php"


# CLI/Productivity
brew "ack"
brew "bat"
brew "rtv"
brew "cowsay"
brew "htop"
brew "tmux"
brew "rmtrash"
brew "tree"
brew "vim"
brew "wget"
brew "git"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "jesseduffield/lazygit/lazygit"
brew "p7zip"
brew "glfw"

# Security
brew "openssl"
brew "openvpn"
brew "aircrack-ng"
brew "gdb"
brew "foremost"
brew "nasm"
brew "hashcat"
brew "cmake", link: false
brew "telnet"
brew "binwalk"

# Apps
cask "alfred"
cask "appcleaner"
cask "apple-juice"
cask "cmake"
cask "cyberduck"
cask "dropbox"
cask "etcher"
cask "flux"
cask "iina"
cask "iterm2"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "vlc"
cask "wireshark"
cask "caskroom/fonts/font-hack-nerd-font"
cask "dteoh/sqa/slowquitapps"
